src/test/resources/requests/EM_GetTN_Nowia.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>em</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">em=123</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns3:getTicketRequest xmlns="http://cio.att.com/commonheader/v3" xmlns:ns2="http://tktsvc.aots.att.com/ticket" xmlns:ns3="http://aots.att.com/ticket/v1" xmlns:ns4="http://cio.att.com/CommonHeader/v1">
            <WSHeader>
                <WSContext>
                    <FromAppId>EM</FromAppId>
                    <SourceIPAddress>aotsyjl.test.att.com</SourceIPAddress>
                </WSContext>
            </WSHeader>
            <ns3:getTicketInput>
                <ns2:FieldsList>
                    <ns2:String>TicketNum</ns2:String>
                    <ns2:String>FunctionalArea</ns2:String>
                    <ns2:String>TicketState</ns2:String>
                    <ns2:String>TicketType</ns2:String>
                    <ns2:String>AccountContactName</ns2:String>
                    <ns2:String>AccountPhone</ns2:String>
                    <ns2:String>AccountExtension</ns2:String>
                    <ns2:String>ReportedBy</ns2:String>
                    <ns2:String>ReportPhone</ns2:String>
                    <ns2:String>ReportExtension</ns2:String>
                    <ns2:String>ReportHoursFrom</ns2:String>
                    <ns2:String>ReportHoursTo</ns2:String>
                    <ns2:String>ReportNote</ns2:String>
                    <ns2:String>ManagedCPEIndicator</ns2:String>
                    <ns2:String>LocationID</ns2:String>
                    <ns2:String>LocationName</ns2:String>
                    <ns2:String>CircuitID</ns2:String>
                    <ns2:String>AssetID</ns2:String>
                    <ns2:String>CustomerAssetAliasName</ns2:String>
                    <ns2:String>ReportedAssetID</ns2:String>
                    <ns2:String>TicketSource</ns2:String>
                    <ns2:String>PVCList</ns2:String>
                    <ns2:String>MCN</ns2:String>
                    <ns2:String>GRC</ns2:String>
                    <ns2:String>ReptSvcImpactFlag</ns2:String>
                    <ns2:String>RequestedCompletionDate</ns2:String>
                    <ns2:String>ProblemAbstract</ns2:String>
                    <ns2:String>Severity</ns2:String>
                    <ns2:String>SeverityClassification</ns2:String>
                    <ns2:String>ClientTicketNum</ns2:String>
                    <ns2:String>PowerToCPE</ns2:String>
                    <ns2:String>AuthTest</ns2:String>
                    <ns2:String>Dispatch</ns2:String>
                    <ns2:String>CustomerChronic</ns2:String>
                    <ns2:String>DLCI</ns2:String>
                    <ns2:String>TicketClosed</ns2:String>
                    <ns2:String>TicketClearedDate</ns2:String>
                    <ns2:String>TicketOpened</ns2:String>
                    <ns2:String>CompletionDeadline</ns2:String>
                    <ns2:String>TroubleReptCode</ns2:String>
                    <ns2:String>AssetType</ns2:String>
                    <ns2:String>LocationAddress</ns2:String>
                    <ns2:String>LocationAddress1</ns2:String>
                    <ns2:String>LocationAddress2</ns2:String>
                    <ns2:String>LocationCity</ns2:String>
                    <ns2:String>LocationRoom</ns2:String>
                    <ns2:String>LocationFloor</ns2:String>
                    <ns2:String>LocationStateProvince</ns2:String>
                    <ns2:String>LocationZipPostal</ns2:String>
                    <ns2:String>VoipOptions</ns2:String>
                    <ns2:String>AccountContactEmail</ns2:String>
                    <ns2:String>ReporterEmailAddr</ns2:String>
                    <ns2:String>CallingTo</ns2:String>
                    <ns2:String>ClientName</ns2:String>
                    <ns2:String>CallbackContact</ns2:String>
                    <ns2:String>CallbackPhone</ns2:String>
                    <ns2:String>ReptSvcLineDescText</ns2:String>
                    <ns2:String>BvoipIndicator</ns2:String>
                    <ns2:String>LastModifiedBy</ns2:String>
                    <ns2:String>OrgGroup</ns2:String>
                    <ns2:String>VendorServiceID</ns2:String>
                    <ns2:String>Chronic</ns2:String>
                    <ns2:String>TroubleReported</ns2:String>
                    <ns2:String>ManagingOrg</ns2:String>
                    <ns2:String>ActiveOrg</ns2:String>
                    <ns2:String>ClientFirstNotified</ns2:String>
                    <ns2:String>ProblemEscalated</ns2:String>
                    <ns2:String>ServiceRestoredDate</ns2:String>
                    <ns2:String>ResolRequestType</ns2:String>
                    <ns2:String>ResolSvcLineDescText</ns2:String>
                    <ns2:String>SvcCompDescText</ns2:String>
                    <ns2:String>ResolItemDescText</ns2:String>
                    <ns2:String>RootCauseDescText</ns2:String>
                    <ns2:String>SubRootCauseDescText</ns2:String>
                    <ns2:String>ResolActionDescText</ns2:String>
                    <ns2:String>EndUserName</ns2:String>
                    <ns2:String>EndUserPhone</ns2:String>
                    <ns2:String>EndUserEmail</ns2:String>
                    <ns2:String>OriginatingOrg</ns2:String>
                    <ns2:String>SharingOrgs</ns2:String>
                    <ns2:String>ReporterEmailNotifyFlag</ns2:String>
                    <ns2:String>Log</ns2:String>
                    <ns2:String>InternalLog</ns2:String>
                    <ns2:String>RemoteAgentID</ns2:String>
                    <ns2:String>AssetPriority</ns2:String>
                    <ns2:String>ReferenceTicketNum</ns2:String>
                    <ns2:String>ReportedProduct</ns2:String>
                    <ns2:String>ReptRequestType</ns2:String>
                    <ns2:String>ResolSvcImpactFlag</ns2:String>
                    <ns2:String>TicketRole</ns2:String>
                    <ns2:String>LastModifiedDate</ns2:String>
                    <ns2:String>ChangeActivityDate</ns2:String>
                    <ns2:String>ChangeActivityID</ns2:String>
                    <ns2:String>ChangeActivitySource</ns2:String>
                    <ns2:String>RepairDuration</ns2:String>
                    <ns2:String>RestoreDuration</ns2:String>
                    <ns2:String>ResolutionText</ns2:String>
                    <ns2:String>TroubleReptDescText</ns2:String>
                    <ns2:String>ResolutionSetDescription</ns2:String>
                    <ns2:String>ChangeActivityType</ns2:String>
                    <ns2:String>AssetName</ns2:String>
                    <ns2:String>TroubleReportedLevel3DescText</ns2:String>
                    <ns2:String>TroubleReptDescText</ns2:String>
                    <ns2:String>EscalationReason</ns2:String>
                    <ns2:String>EscalationLevel</ns2:String>
                    <ns2:String>EscalationDeadline</ns2:String>
                    <ns2:String>AccessCircuitID</ns2:String>
                    <ns2:String>DomainName</ns2:String>
                    <ns2:String>DispatchAuthorized</ns2:String>
                    <ns2:String>MSO</ns2:String>
                    <ns2:String>SOC</ns2:String>
                    <ns2:String>BvoipIndicator</ns2:String>
                    <ns2:String>SiteName</ns2:String>
                    <ns2:String>LocationCountry</ns2:String>
                    <ns2:String>ImpactedCircuitList</ns2:String>
                    <ns2:String>CRIPv4Address</ns2:String>
                    <ns2:String>CRIPv6Address</ns2:String>
                    <ns2:String>ServiceClassification</ns2:String>
                    <ns2:String>ISOCountryCode</ns2:String>
                    <ns2:String>ContractDescription</ns2:String>
                    <ns2:String>ContractNumber</ns2:String>
                    <ns2:String>AgencyName</ns2:String>
                    <ns2:String>AgencyID</ns2:String>
                    <ns2:String>AdjTimeToRepair</ns2:String>
                    <ns2:String>AdjTimeToRestore</ns2:String>
                    <ns2:String>BvoipProbeIndicator</ns2:String>
                    <ns2:String>AlternateRole</ns2:String>
                    <ns2:String>EnhancedFeatureIndicator</ns2:String>
                    <ns2:String>ContractID</ns2:String>
                    <ns2:String>CustomerPONumber</ns2:String>
                    <ns2:String>EstTimeOfArrival</ns2:String>
                    <ns2:String>TicketDueDate</ns2:String>
                    <ns2:String>LastCustomerContact</ns2:String>
                    <ns2:String>PremiseEquipmentIndicator</ns2:String>
                    <ns2:String>AccessProviderIndicator</ns2:String>
                    <ns2:String>LastTimeAPContacted</ns2:String>
                    <ns2:String>TypeDispatchAP</ns2:String>
                    <ns2:String>TypeDispatchEqp</ns2:String>
                    <ns2:String>CurrentStatus</ns2:String>
                    <ns2:String>CurrentStatusTime</ns2:String>
                    <ns2:String>EstTimeToRepair</ns2:String>
                    <ns2:String>ATSRoomName</ns2:String>
                    <ns2:String>GDBAssetObjectID</ns2:String>
                    <ns2:String>GDBContactObjectID</ns2:String>
                    <ns2:String>GDBOrgObjectID</ns2:String>
                    <ns2:String>ValidateDispatchAuth</ns2:String>
                    <ns2:String>ValidateTestAuth</ns2:String>
                    <ns2:String>ValidatePowerToCPE</ns2:String>
                    <ns2:String>ValidateLocationAccessHours</ns2:String>
                    <ns2:String>ValidationResponsesRcvd</ns2:String>
                    <ns2:String>ReportedCustomerType</ns2:String>
                    <ns2:String>ClientHelpdesk</ns2:String>
                    <ns2:String>ScheduleLaterDate</ns2:String>
                    <ns2:String>CalnetContract</ns2:String>
                    <ns2:String>SupportingNetwork</ns2:String>
                    <ns2:String>CallingFrom</ns2:String>
                    <ns2:String>CallingTo</ns2:String>
                    <ns2:String>TOS</ns2:String>
                    <ns2:String>ReportedEVCs</ns2:String>
                    <ns2:String>CustomerSubsID</ns2:String>
                    <ns2:String>SupportRequestType</ns2:String>
                    <ns2:String>ProductID</ns2:String>
                    <ns2:String>CascadedToUCPE</ns2:String>
                    <ns2:String>UBID</ns2:String>
                    <ns2:String>ContractType</ns2:String>
                    <ns2:String>ACNA</ns2:String>
                    <ns2:String>BAN</ns2:String>
                    <ns2:String>ResolutionSetName</ns2:String>
                </ns2:FieldsList>
                <ns2:TicketNum>CS0012986</ns2:TicketNum>
                <ns2:LogQualifier>1</ns2:LogQualifier>
                <ns2:GetLocationInfo>false</ns2:GetLocationInfo>
                <ns2:GetPVCDetailsInfo>true</ns2:GetPVCDetailsInfo>
                <ns2:GetLocationDetailsInfo>true</ns2:GetLocationDetailsInfo>
                <ns2:GetBvoipLocationInfo>true</ns2:GetBvoipLocationInfo>
                <ns2:GetLCONDetailsInfo>true</ns2:GetLCONDetailsInfo>
            </ns3:getTicketInput>
        </ns3:getTicketRequest>
    </soap:Body>
</soap:Envelope>